Ran Plan for dir: `terragrunt-integration/terraform` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' 'terragrunt run plan --all' in '/home/atlantis/.atlantis/repos/jefersonlemos/atlantis-playground/24/default/terragrunt-integration/terraform': exit status 1: running "terragrunt run plan --all" in "/home/atlantis/.atlantis/repos/jefersonlemos/atlantis-playground/24/default/terragrunt-integration/terraform": 
20:21:56.708 WARN   The `TERRAGRUNT_TFPATH` environment variable is deprecated and will be removed in a future version of Terragrunt. Use `TG_TF_PATH=terraform1.11.4` instead.
20:21:56.715 INFO   The runner at . will be processed in the following order for command plan:
Group 1
- Unit .
- Unit ./modules/random

Group 2
- Unit ./app1
- Unit ./app2


20:21:56.764 INFO   Downloading Terraform configurations from ./modules/random into ./.terragrunt-cache/FM2cVcne_h_aGJspV41p5OTiea4/lUTsEvgTj3qV-S7u0nTZ3wnx7Ec
20:21:56.788 INFO   [modules/random] terraform1.11.4: Initializing the backend...
20:21:56.788 INFO   [modules/random] terraform1.11.4: Initializing provider plugins...
20:21:56.788 INFO   [modules/random] terraform1.11.4: - Finding latest version of hashicorp/random...
20:21:56.789 INFO   terraform1.11.4: Initializing the backend...
20:21:56.789 INFO   terraform1.11.4: Initializing provider plugins...
20:21:56.790 INFO   terraform1.11.4: - Finding latest version of hashicorp/random...
20:21:57.023 INFO   [modules/random] terraform1.11.4: - Installing hashicorp/random v3.7.2...
20:21:57.030 INFO   terraform1.11.4: - Installing hashicorp/random v3.7.2...
20:21:58.217 INFO   [modules/random] terraform1.11.4: - Installed hashicorp/random v3.7.2 (signed by HashiCorp)
20:21:58.217 INFO   [modules/random] terraform1.11.4: Terraform has created a lock file .terraform.lock.hcl to record the provider
20:21:58.217 INFO   [modules/random] terraform1.11.4: selections it made above. Include this file in your version control repository
20:21:58.218 INFO   [modules/random] terraform1.11.4: so that Terraform can guarantee to make the same selections by default when
20:21:58.218 INFO   [modules/random] terraform1.11.4: you run "terraform init" in the future.
20:21:58.218 INFO   [modules/random] terraform1.11.4: Terraform has been successfully initialized!
20:21:58.374 STDOUT [modules/random] terraform1.11.4: Terraform used the selected providers to generate the following execution
20:21:58.374 STDOUT [modules/random] terraform1.11.4: plan. Resource actions are indicated with the following symbols:
20:21:58.374 STDOUT [modules/random] terraform1.11.4:   + create
20:21:58.374 STDOUT [modules/random] terraform1.11.4: Terraform will perform the following actions:
20:21:58.374 STDOUT [modules/random] terraform1.11.4:   # random_string.base_bucket_name will be created
20:21:58.374 STDOUT [modules/random] terraform1.11.4:   + resource "random_string" "base_bucket_name" {
20:21:58.374 STDOUT [modules/random] terraform1.11.4:       + id          = (known after apply)
20:21:58.374 STDOUT [modules/random] terraform1.11.4:       + length      = 4
20:21:58.374 STDOUT [modules/random] terraform1.11.4:       + lower       = true
20:21:58.374 STDOUT [modules/random] terraform1.11.4:       + min_lower   = 0
20:21:58.374 STDOUT [modules/random] terraform1.11.4:       + min_numeric = 0
20:21:58.374 STDOUT [modules/random] terraform1.11.4:       + min_special = 0
20:21:58.374 STDOUT [modules/random] terraform1.11.4:       + min_upper   = 0
20:21:58.374 STDOUT [modules/random] terraform1.11.4:       + number      = false
20:21:58.374 STDOUT [modules/random] terraform1.11.4:       + numeric     = false
20:21:58.374 STDOUT [modules/random] terraform1.11.4:       + result      = (known after apply)
20:21:58.374 STDOUT [modules/random] terraform1.11.4:       + special     = false
20:21:58.374 STDOUT [modules/random] terraform1.11.4:       + upper       = true
20:21:58.374 STDOUT [modules/random] terraform1.11.4:     }
20:21:58.374 STDOUT [modules/random] terraform1.11.4: Plan: 1 to add, 0 to change, 0 to destroy.
20:21:58.374 STDOUT [modules/random] terraform1.11.4: 
20:21:58.375 STDOUT [modules/random] terraform1.11.4: Changes to Outputs:
20:21:58.375 STDOUT [modules/random] terraform1.11.4:   + base_bucket_name = (known after apply)
20:21:58.686 INFO   terraform1.11.4: - Installed hashicorp/random v3.7.2 (signed by HashiCorp)
20:21:58.686 INFO   terraform1.11.4: Terraform has created a lock file .terraform.lock.hcl to record the provider
20:21:58.686 INFO   terraform1.11.4: selections it made above. Include this file in your version control repository
20:21:58.687 INFO   terraform1.11.4: so that Terraform can guarantee to make the same selections by default when
20:21:58.687 INFO   terraform1.11.4: you run "terraform init" in the future.
20:21:58.687 INFO   terraform1.11.4: Terraform has been successfully initialized!
20:21:58.825 STDOUT terraform1.11.4: Terraform used the selected providers to generate the following execution
20:21:58.825 STDOUT terraform1.11.4: plan. Resource actions are indicated with the following symbols:
20:21:58.825 STDOUT terraform1.11.4:   + create
20:21:58.825 STDOUT terraform1.11.4: Terraform will perform the following actions:
20:21:58.825 STDOUT terraform1.11.4:   # random_string.base_bucket_name will be created
20:21:58.825 STDOUT terraform1.11.4:   + resource "random_string" "base_bucket_name" {
20:21:58.825 STDOUT terraform1.11.4:       + id          = (known after apply)
20:21:58.825 STDOUT terraform1.11.4:       + length      = 4
20:21:58.826 STDOUT terraform1.11.4:       + lower       = true
20:21:58.826 STDOUT terraform1.11.4:       + min_lower   = 0
20:21:58.826 STDOUT terraform1.11.4:       + min_numeric = 0
20:21:58.826 STDOUT terraform1.11.4:       + min_special = 0
20:21:58.826 STDOUT terraform1.11.4:       + min_upper   = 0
20:21:58.826 STDOUT terraform1.11.4:       + number      = false
20:21:58.826 STDOUT terraform1.11.4:       + numeric     = false
20:21:58.826 STDOUT terraform1.11.4:       + result      = (known after apply)
20:21:58.826 STDOUT terraform1.11.4:       + special     = false
20:21:58.826 STDOUT terraform1.11.4:       + upper       = true
20:21:58.826 STDOUT terraform1.11.4:     }
20:21:58.826 STDOUT terraform1.11.4: Plan: 1 to add, 0 to change, 0 to destroy.
20:21:58.826 STDOUT terraform1.11.4: 
20:21:58.826 STDOUT terraform1.11.4: Changes to Outputs:
20:21:58.826 STDOUT terraform1.11.4:   + base_bucket_name = (known after apply)
20:21:58.835 INFO   Downloading Terraform configurations from ./modules/random into ./.terragrunt-cache/FM2cVcne_h_aGJspV41p5OTiea4/lUTsEvgTj3qV-S7u0nTZ3wnx7Ec
20:21:58.862 INFO   terraform1.11.4: Initializing the backend...
20:21:58.873 INFO   terraform1.11.4: Initializing provider plugins...
20:21:58.873 INFO   terraform1.11.4: - Reusing previous version of hashicorp/random from the dependency lock file
20:21:58.950 INFO   terraform1.11.4: - Using previously-installed hashicorp/random v3.7.2
20:21:58.950 INFO   terraform1.11.4: Terraform has been successfully initialized!
20:21:58.996 WARN   [app2] Config ./commons.hcl is a dependency of ./app2/terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
20:21:58.996 WARN   [app1] Config ./commons.hcl is a dependency of ./app1/terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
20:21:58.997 INFO   [app2] Downloading Terraform configurations from ./modules/s3-bucket into ./app2/.terragrunt-cache/yWwOfNhttdvKoeqm2H9LVp_JiXI/9Jcw7tzvGZrNTV0TnqzTSoWPTFM
20:21:58.997 INFO   [app1] Downloading Terraform configurations from ./modules/s3-bucket into ./app1/.terragrunt-cache/v126U9jLjelVwLf3r07wLKt-eAo/9Jcw7tzvGZrNTV0TnqzTSoWPTFM
20:21:59.024 INFO   [app1] terraform1.11.4: Initializing the backend...
20:21:59.024 INFO   [app1] terraform1.11.4: Initializing provider plugins...
20:21:59.024 INFO   [app1] terraform1.11.4: - Finding hashicorp/aws versions matching "~> 5.0"...
20:21:59.025 INFO   [app2] terraform1.11.4: Initializing the backend...
20:21:59.026 INFO   [app2] terraform1.11.4: Initializing provider plugins...
20:21:59.026 INFO   [app2] terraform1.11.4: - Finding hashicorp/aws versions matching "~> 5.0"...
20:21:59.193 INFO   [app1] terraform1.11.4: - Installing hashicorp/aws v5.100.0...
20:21:59.200 INFO   [app2] terraform1.11.4: - Installing hashicorp/aws v5.100.0...
20:23:23.099 INFO   [app1] terraform1.11.4: - Installed hashicorp/aws v5.100.0 (signed by HashiCorp)
20:23:23.100 INFO   [app1] terraform1.11.4: Terraform has created a lock file .terraform.lock.hcl to record the provider
20:23:23.100 INFO   [app1] terraform1.11.4: selections it made above. Include this file in your version control repository
20:23:23.100 INFO   [app1] terraform1.11.4: so that Terraform can guarantee to make the same selections by default when
20:23:23.100 INFO   [app1] terraform1.11.4: you run "terraform init" in the future.
20:23:23.100 INFO   [app1] terraform1.11.4: Terraform has been successfully initialized!
20:23:24.607 INFO   [app2] terraform1.11.4: - Installed hashicorp/aws v5.100.0 (signed by HashiCorp)
20:23:24.607 INFO   [app2] terraform1.11.4: Terraform has made some changes to the provider dependency selections recorded
20:23:24.607 INFO   [app2] terraform1.11.4: in the .terraform.lock.hcl file. Review those changes and commit them to your
20:23:24.607 INFO   [app2] terraform1.11.4: version control system if they represent changes you intended to make.
20:23:24.607 INFO   [app2] terraform1.11.4: Terraform has been successfully initialized!
20:23:30.680 STDOUT [app1] terraform1.11.4: Planning failed. Terraform encountered an error while generating this plan.
20:23:30.680 STDOUT [app1] terraform1.11.4: 
20:23:30.681 STDOUT [app1] terraform1.11.4: ╷
20:23:30.681 STDOUT [app1] terraform1.11.4: │ Warning: Argument is deprecated
20:23:30.681 STDOUT [app1] terraform1.11.4: │ 
20:23:30.681 STDOUT [app1] terraform1.11.4: │   with aws_s3_bucket.this,
20:23:30.681 STDOUT [app1] terraform1.11.4: │   on bucket.tf line 17, in resource "aws_s3_bucket" "this":
20:23:30.681 STDOUT [app1] terraform1.11.4: │   17:   acl    = "private"
20:23:30.681 STDOUT [app1] terraform1.11.4: │ 
20:23:30.681 STDOUT [app1] terraform1.11.4: │ acl is deprecated. Use the aws_s3_bucket_acl resource instead.
20:23:30.681 STDOUT [app1] terraform1.11.4: ╵
20:23:30.681 STDERR [app1] terraform1.11.4: ╷
20:23:30.681 STDERR [app1] terraform1.11.4: │ Error: No valid credential sources found
20:23:30.681 STDERR [app1] terraform1.11.4: │ 
20:23:30.681 STDERR [app1] terraform1.11.4: │   with provider["registry.terraform.io/hashicorp/aws"],
20:23:30.681 STDERR [app1] terraform1.11.4: │   on bucket.tf line 11, in provider "aws":
20:23:30.681 STDERR [app1] terraform1.11.4: │   11: provider "aws" {
20:23:30.681 STDERR [app1] terraform1.11.4: │ 
20:23:30.681 STDERR [app1] terraform1.11.4: │ Please see https://registry.terraform.io/providers/hashicorp/aws
20:23:30.681 STDERR [app1] terraform1.11.4: │ for more information about providing credentials.
20:23:30.681 STDERR [app1] terraform1.11.4: │ 
20:23:30.681 STDERR [app1] terraform1.11.4: │ Error: failed to refresh cached credentials, no EC2 IMDS role found,
20:23:30.681 STDERR [app1] terraform1.11.4: │ operation error ec2imds: GetMetadata, request canceled, context deadline
20:23:30.681 STDERR [app1] terraform1.11.4: │ exceeded
20:23:30.681 STDERR [app1] terraform1.11.4: │ 
20:23:30.681 STDERR [app1] terraform1.11.4: ╵
20:23:30.695 ERROR  [app1] terraform invocation failed in ./app1/.terragrunt-cache/v126U9jLjelVwLf3r07wLKt-eAo/9Jcw7tzvGZrNTV0TnqzTSoWPTFM
20:23:30.695 ERROR  [app1] Unit ./app1 has finished with an error
20:23:31.966 STDOUT [app2] terraform1.11.4: Planning failed. Terraform encountered an error while generating this plan.
20:23:31.966 STDOUT [app2] terraform1.11.4: 
20:23:31.966 STDOUT [app2] terraform1.11.4: ╷
20:23:31.966 STDOUT [app2] terraform1.11.4: │ Warning: Argument is deprecated
20:23:31.966 STDOUT [app2] terraform1.11.4: │ 
20:23:31.966 STDOUT [app2] terraform1.11.4: │   with aws_s3_bucket.this,
20:23:31.966 STDOUT [app2] terraform1.11.4: │   on bucket.tf line 17, in resource "aws_s3_bucket" "this":
20:23:31.966 STDOUT [app2] terraform1.11.4: │   17:   acl    = "private"
20:23:31.967 STDOUT [app2] terraform1.11.4: │ 
20:23:31.967 STDOUT [app2] terraform1.11.4: │ acl is deprecated. Use the aws_s3_bucket_acl resource instead.
20:23:31.967 STDOUT [app2] terraform1.11.4: ╵
20:23:31.967 STDERR [app2] terraform1.11.4: ╷
20:23:31.967 STDERR [app2] terraform1.11.4: │ Error: No valid credential sources found
20:23:31.967 STDERR [app2] terraform1.11.4: │ 
20:23:31.967 STDERR [app2] terraform1.11.4: │   with provider["registry.terraform.io/hashicorp/aws"],
20:23:31.967 STDERR [app2] terraform1.11.4: │   on bucket.tf line 11, in provider "aws":
20:23:31.967 STDERR [app2] terraform1.11.4: │   11: provider "aws" {
20:23:31.967 STDERR [app2] terraform1.11.4: │ 
20:23:31.967 STDERR [app2] terraform1.11.4: │ Please see https://registry.terraform.io/providers/hashicorp/aws
20:23:31.967 STDERR [app2] terraform1.11.4: │ for more information about providing credentials.
20:23:31.967 STDERR [app2] terraform1.11.4: │ 
20:23:31.967 STDERR [app2] terraform1.11.4: │ Error: failed to refresh cached credentials, no EC2 IMDS role found,
20:23:31.967 STDERR [app2] terraform1.11.4: │ operation error ec2imds: GetMetadata, request canceled, context deadline
20:23:31.967 STDERR [app2] terraform1.11.4: │ exceeded
20:23:31.967 STDERR [app2] terraform1.11.4: │ 
20:23:31.967 STDERR [app2] terraform1.11.4: ╵
20:23:31.981 ERROR  [app2] terraform invocation failed in ./app2/.terragrunt-cache/yWwOfNhttdvKoeqm2H9LVp_JiXI/9Jcw7tzvGZrNTV0TnqzTSoWPTFM
20:23:31.981 ERROR  [app2] Unit ./app2 has finished with an error
20:23:31.981 ERROR  Run failed: 2 errors occurred:

* Failed to execute "terraform1.11.4 plan -input=false" in ./app1/.terragrunt-cache/v126U9jLjelVwLf3r07wLKt-eAo/9Jcw7tzvGZrNTV0TnqzTSoWPTFM
  ╷
  │ Error: No valid credential sources found
  │ 
  │   with provider["registry.terraform.io/hashicorp/aws"],
  │   on bucket.tf line 11, in provider "aws":
  │   11: provider "aws" {
  │ 
  │ Please see https://registry.terraform.io/providers/hashicorp/aws
  │ for more information about providing credentials.
  │ 
  │ Error: failed to refresh cached credentials, no EC2 IMDS role found,
  │ operation error ec2imds: GetMetadata, request canceled, context deadline
  │ exceeded
  │ 
  ╵
  
  exit status 1

* Failed to execute "terraform1.11.4 plan -input=false" in ./app2/.terragrunt-cache/yWwOfNhttdvKoeqm2H9LVp_JiXI/9Jcw7tzvGZrNTV0TnqzTSoWPTFM
  ╷
  │ Error: No valid credential sources found
  │ 
  │   with provider["registry.terraform.io/hashicorp/aws"],
  │   on bucket.tf line 11, in provider "aws":
  │   11: provider "aws" {
  │ 
  │ Please see https://registry.terraform.io/providers/hashicorp/aws
  │ for more information about providing credentials.
  │ 
  │ Error: failed to refresh cached credentials, no EC2 IMDS role found,
  │ operation error ec2imds: GetMetadata, request canceled, context deadline
  │ exceeded
  │ 
  ╵
  
  exit status 1


>>>> PLANNING CHANGES <<<<

/home/atlantis/.atlantis/repos/jefersonlemos/atlantis-playground/24/default/terragrunt-integration/terraform

```
</details>